; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 - counter
	)
  (:init
		(= (value c0) 63)
	(= (value c1) 55)
	(= (value c2) 64)
	(= (value c3) 76)
	(= (value c4) 55)
	(= (value c5) 24)
	(= (value c6) 26)
	(= (value c7) 55)
	(= (value c8) 51)
	(= (value c9) 49)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
		)
	)
)

; plan
1. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 4 of 9
2. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 9
3. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 9
4. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 9
5. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 4 of 9
6. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 4 of 9
7. (increment c9)
   changed: (value c9) from 49 to 52
   goals met: 5 of 9
8. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 9
9. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 9
10. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 5 of 9
11. (increment c8)
   changed: (value c8) from 51 to 54
   goals met: 4 of 9
12. (increment c9)
   changed: (value c9) from 52 to 55
   goals met: 5 of 9
13. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 9
14. (decrement_rate c4)
   changed: (rate_value c4) from 1 to 0
   goals met: 5 of 9
15. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 9
16. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 5 of 9
17. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 5 of 9
18. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 5 of 9
19. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 5 of 9
20. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 5 of 9
21. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 5 of 9
22. (increment c1)
   changed: (value c1) from 55 to 60
   goals met: 5 of 9
23. (increment c8)
   changed: (value c8) from 54 to 57
   goals met: 5 of 9
24. (increment c9)
   changed: (value c9) from 55 to 58
   goals met: 6 of 9
25. (decrement c3)
   changed: (value c3) from 76 to 71
   goals met: 6 of 9
26. (decrement c3)
   changed: (value c3) from 71 to 66
   goals met: 6 of 9
27. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 6 of 9
28. (decrement c3)
   changed: (value c3) from 66 to 60
   goals met: 5 of 9
29. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 5 of 9
30. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 5 of 9
31. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 5 of 9
32. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 5 of 9
33. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 5 of 9
34. (increment c5)
   changed: (value c5) from 24 to 29
   goals met: 4 of 9
35. (increment c5)
   changed: (value c5) from 29 to 34
   goals met: 4 of 9
36. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 9
37. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 9
38. (increment c6)
   changed: (value c6) from 26 to 28
   goals met: 4 of 9
39. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 4 of 9
40. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 4 of 9
41. (increment c5)
   changed: (value c5) from 34 to 41
   goals met: 4 of 9
42. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 4 of 9
43. (increment c5)
   changed: (value c5) from 41 to 49
   goals met: 4 of 9
44. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 4 of 9
45. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 4 of 9
46. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 9
47. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 4 of 9
48. (increment c6)
   changed: (value c6) from 28 to 32
   goals met: 4 of 9
49. (increment c6)
   changed: (value c6) from 32 to 36
   goals met: 4 of 9
50. (increment c6)
   changed: (value c6) from 36 to 40
   goals met: 4 of 9
51. (increment c6)
   changed: (value c6) from 40 to 44
   goals met: 4 of 9
52. (increment c6)
   changed: (value c6) from 44 to 48
   goals met: 4 of 9
53. (increment c6)
   changed: (value c6) from 48 to 52
   goals met: 5 of 9
54. (decrement c3)
   changed: (value c3) from 60 to 54
   goals met: 6 of 9
55. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 6 of 9
56. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 6 of 9
57. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 6 of 9
58. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 6 of 9
59. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 6 of 9
60. (increment c3)
   changed: (value c3) from 54 to 64
   goals met: 5 of 9
61. (decrement c2)
   changed: (value c2) from 64 to 63
   goals met: 6 of 9
62. (increment c5)
   changed: (value c5) from 49 to 59
   goals met: 6 of 9
63. (increment c6)
   changed: (value c6) from 52 to 56
   goals met: 5 of 9
64. (increment c6)
   changed: (value c6) from 56 to 60
   goals met: 6 of 9
65. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 6 of 9
66. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 6 of 9
67. (increment c7)
   changed: (value c7) from 55 to 57
   goals met: 5 of 9
68. (increment c8)
   changed: (value c8) from 57 to 60
   goals met: 5 of 9
69. (increment c9)
   changed: (value c9) from 58 to 61
   goals met: 6 of 9
70. (increment c7)
   changed: (value c7) from 57 to 59
   goals met: 6 of 9
71. (increment c7)
   changed: (value c7) from 59 to 61
   goals met: 6 of 9
72. (increment c8)
   changed: (value c8) from 60 to 63
   goals met: 6 of 9
73. (increment c9)
   changed: (value c9) from 61 to 64
   goals met: 7 of 9
74. (decrement c3)
   changed: (value c3) from 64 to 54
   goals met: 7 of 9
75. (decrement c2)
   changed: (value c2) from 63 to 62
   goals met: 7 of 9
76. (decrement c2)
   changed: (value c2) from 62 to 61
   goals met: 7 of 9
77. (decrement c2)
   changed: (value c2) from 61 to 60
   goals met: 6 of 9
78. (increment c3)
   changed: (value c3) from 54 to 64
   goals met: 6 of 9
79. (decrement c1)
   changed: (value c1) from 60 to 55
   goals met: 7 of 9
80. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 7 of 9
81. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 7 of 9
82. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 7 of 9
83. (decrement c0)
   changed: (value c0) from 63 to 60
   goals met: 7 of 9
84. (decrement c0)
   changed: (value c0) from 60 to 57
   goals met: 7 of 9
85. (decrement c0)
   changed: (value c0) from 57 to 54
   goals met: 8 of 9
86. (decrement c3)
   changed: (value c3) from 64 to 54
   goals met: 8 of 9
87. (decrement c2)
   changed: (value c2) from 60 to 59
   goals met: 8 of 9
88. (decrement c2)
   changed: (value c2) from 59 to 58
   goals met: 8 of 9
89. (decrement c2)
   changed: (value c2) from 58 to 57
   goals met: 8 of 9
90. (decrement c2)
   changed: (value c2) from 57 to 56
   goals met: 8 of 9
91. (decrement c2)
   changed: (value c2) from 56 to 55
   goals met: 7 of 9
92. (decrement c2)
   changed: (value c2) from 55 to 54
   goals met: 7 of 9
93. (decrement c2)
   changed: (value c2) from 54 to 53
   goals met: 8 of 9
94. (decrement c1)
   changed: (value c1) from 55 to 50
   goals met: 8 of 9
95. (decrement c0)
   changed: (value c0) from 54 to 51
   goals met: 8 of 9
96. (decrement c0)
   changed: (value c0) from 51 to 48
   goals met: 9 of 9
